GopalSaraf/Practicals/PSDL/include/proc/pic18f86k22.inc
// Register: ANCON2
#define ANCON2 ANCON2
ANCON2                                   equ 0F23h
// bitfield definitions
ANCON2_ANSEL16_POSN                      equ 0000h
ANCON2_ANSEL16_POSITION                  equ 0000h
ANCON2_ANSEL16_SIZE                      equ 0001h
ANCON2_ANSEL16_LENGTH                    equ 0001h
ANCON2_ANSEL16_MASK                      equ 0001h
ANCON2_ANSEL17_POSN                      equ 0001h
ANCON2_ANSEL17_POSITION                  equ 0001h
ANCON2_ANSEL17_SIZE                      equ 0001h
ANCON2_ANSEL17_LENGTH                    equ 0001h
ANCON2_ANSEL17_MASK                      equ 0002h
ANCON2_ANSEL18_POSN                      equ 0002h
ANCON2_ANSEL18_POSITION                  equ 0002h
ANCON2_ANSEL18_SIZE                      equ 0001h
ANCON2_ANSEL18_LENGTH                    equ 0001h
ANCON2_ANSEL18_MASK                      equ 0004h
ANCON2_ANSEL19_POSN                      equ 0003h
ANCON2_ANSEL19_POSITION                  equ 0003h
ANCON2_ANSEL19_SIZE                      equ 0001h
ANCON2_ANSEL19_LENGTH                    equ 0001h
ANCON2_ANSEL19_MASK                      equ 0008h
ANCON2_ANSEL20_POSN                      equ 0004h
ANCON2_ANSEL20_POSITION                  equ 0004h
ANCON2_ANSEL20_SIZE                      equ 0001h
ANCON2_ANSEL20_LENGTH                    equ 0001h
ANCON2_ANSEL20_MASK                      equ 0010h
ANCON2_ANSEL21_POSN                      equ 0005h
ANCON2_ANSEL21_POSITION                  equ 0005h
ANCON2_ANSEL21_SIZE                      equ 0001h
ANCON2_ANSEL21_LENGTH                    equ 0001h
ANCON2_ANSEL21_MASK                      equ 0020h
ANCON2_ANSEL22_POSN                      equ 0006h
ANCON2_ANSEL22_POSITION                  equ 0006h
ANCON2_ANSEL22_SIZE                      equ 0001h
ANCON2_ANSEL22_LENGTH                    equ 0001h
ANCON2_ANSEL22_MASK                      equ 0040h
ANCON2_ANSEL23_POSN                      equ 0007h
ANCON2_ANSEL23_POSITION                  equ 0007h
ANCON2_ANSEL23_SIZE                      equ 0001h
ANCON2_ANSEL23_LENGTH                    equ 0001h
ANCON2_ANSEL23_MASK                      equ 0080h
ANCON2_PCFG16_POSN                       equ 0000h
ANCON2_PCFG16_POSITION                   equ 0000h
ANCON2_PCFG16_SIZE                       equ 0001h
ANCON2_PCFG16_LENGTH                     equ 0001h
ANCON2_PCFG16_MASK                       equ 0001h
ANCON2_PCFG17_POSN                       equ 0001h
ANCON2_PCFG17_POSITION                   equ 0001h
ANCON2_PCFG17_SIZE                       equ 0001h
ANCON2_PCFG17_LENGTH                     equ 0001h
ANCON2_PCFG17_MASK                       equ 0002h
ANCON2_PCFG18_POSN                       equ 0002h
ANCON2_PCFG18_POSITION                   equ 0002h
ANCON2_PCFG18_SIZE                       equ 0001h
ANCON2_PCFG18_LENGTH                     equ 0001h
ANCON2_PCFG18_MASK                       equ 0004h
ANCON2_PCFG19_POSN                       equ 0003h
ANCON2_PCFG19_POSITION                   equ 0003h
ANCON2_PCFG19_SIZE                       equ 0001h
ANCON2_PCFG19_LENGTH                     equ 0001h
ANCON2_PCFG19_MASK                       equ 0008h
ANCON2_PCFG20_POSN                       equ 0004h
ANCON2_PCFG20_POSITION                   equ 0004h
ANCON2_PCFG20_SIZE                       equ 0001h
ANCON2_PCFG20_LENGTH                     equ 0001h
ANCON2_PCFG20_MASK                       equ 0010h
ANCON2_PCFG21_POSN                       equ 0005h
ANCON2_PCFG21_POSITION                   equ 0005h
ANCON2_PCFG21_SIZE                       equ 0001h
ANCON2_PCFG21_LENGTH                     equ 0001h
ANCON2_PCFG21_MASK                       equ 0020h
ANCON2_PCFG22_POSN                       equ 0006h
ANCON2_PCFG22_POSITION                   equ 0006h
ANCON2_PCFG22_SIZE                       equ 0001h
ANCON2_PCFG22_LENGTH                     equ 0001h
ANCON2_PCFG22_MASK                       equ 0040h
ANCON2_PCFG23_POSN                       equ 0007h
ANCON2_PCFG23_POSITION                   equ 0007h
ANCON2_PCFG23_SIZE                       equ 0001h
ANCON2_PCFG23_LENGTH                     equ 0001h
ANCON2_PCFG23_MASK                       equ 0080h

// Register: ANCON1
#define ANCON1 ANCON1
ANCON1                                   equ 0F24h
// bitfield definitions
ANCON1_ANSEL8_POSN                       equ 0000h
ANCON1_ANSEL8_POSITION                   equ 0000h
ANCON1_ANSEL8_SIZE                       equ 0001h
ANCON1_ANSEL8_LENGTH                     equ 0001h
ANCON1_ANSEL8_MASK                       equ 0001h
ANCON1_ANSEL9_POSN                       equ 0001h
ANCON1_ANSEL9_POSITION                   equ 0001h
ANCON1_ANSEL9_SIZE                       equ 0001h
ANCON1_ANSEL9_LENGTH                     equ 0001h
ANCON1_ANSEL9_MASK                       equ 0002h
ANCON1_ANSEL10_POSN                      equ 0002h
ANCON1_ANSEL10_POSITION                  equ 0002h
ANCON1_ANSEL10_SIZE                      equ 0001h
ANCON1_ANSEL10_LENGTH                    equ 0001h
ANCON1_ANSEL10_MASK                      equ 0004h
ANCON1_ANSEL11_POSN                      equ 0003h
ANCON1_ANSEL11_POSITION                  equ 0003h
ANCON1_ANSEL11_SIZE                      equ 0001h
ANCON1_ANSEL11_LENGTH                    equ 0001h
ANCON1_ANSEL11_MASK                      equ 0008h
ANCON1_ANSEL12_POSN                      equ 0004h
ANCON1_ANSEL12_POSITION                  equ 0004h
ANCON1_ANSEL12_SIZE                      equ 0001h
ANCON1_ANSEL12_LENGTH                    equ 0001h
ANCON1_ANSEL12_MASK                      equ 0010h
ANCON1_ANSEL13_POSN                      equ 0005h
ANCON1_ANSEL13_POSITION                  equ 0005h
ANCON1_ANSEL13_SIZE                      equ 0001h
ANCON1_ANSEL13_LENGTH                    equ 0001h
ANCON1_ANSEL13_MASK                      equ 0020h
ANCON1_ANSEL14_POSN                      equ 0006h
ANCON1_ANSEL14_POSITION                  equ 0006h
ANCON1_ANSEL14_SIZE                      equ 0001h
ANCON1_ANSEL14_LENGTH                    equ 0001h
ANCON1_ANSEL14_MASK                      equ 0040h
ANCON1_ANSEL15_POSN                      equ 0007h
ANCON1_ANSEL15_POSITION                  equ 0007h
ANCON1_ANSEL15_SIZE                      equ 0001h
ANCON1_ANSEL15_LENGTH                    equ 0001h
ANCON1_ANSEL15_MASK                      equ 0080h
ANCON1_PCFG8_POSN                        equ 0000h
ANCON1_PCFG8_POSITION                    equ 0000h
ANCON1_PCFG8_SIZE                        equ 0001h
ANCON1_PCFG8_LENGTH                      equ 0001h
ANCON1_PCFG8_MASK                        equ 0001h
ANCON1_PCFG9_POSN                        equ 0001h
ANCON1_PCFG9_POSITION                    equ 0001h
ANCON1_PCFG9_SIZE                        equ 0001h
ANCON1_PCFG9_LENGTH                      equ 0001h
ANCON1_PCFG9_MASK                        equ 0002h
ANCON1_PCFG10_POSN                       equ 0002h
ANCON1_PCFG10_POSITION                   equ 0002h
ANCON1_PCFG10_SIZE                       equ 0001h
ANCON1_PCFG10_LENGTH                     equ 0001h
ANCON1_PCFG10_MASK                       equ 0004h
ANCON1_PCFG11_POSN                       equ 0003h
ANCON1_PCFG11_POSITION                   equ 0003h
ANCON1_PCFG11_SIZE                       equ 0001h
ANCON1_PCFG11_LENGTH                     equ 0001h
ANCON1_PCFG11_MASK                       equ 0008h
ANCON1_PCFG12_POSN                       equ 0004h
ANCON1_PCFG12_POSITION                   equ 0004h
ANCON1_PCFG12_SIZE                       equ 0001h
ANCON1_PCFG12_LENGTH                     equ 0001h
ANCON1_PCFG12_MASK                       equ 0010h
ANCON1_PCFG13_POSN                       equ 0005h
ANCON1_PCFG13_POSITION                   equ 0005h
ANCON1_PCFG13_SIZE                       equ 0001h
ANCON1_PCFG13_LENGTH                     equ 0001h
ANCON1_PCFG13_MASK                       equ 0020h
ANCON1_PCFG14_POSN                       equ 0006h
ANCON1_PCFG14_POSITION                   equ 0006h
ANCON1_PCFG14_SIZE                       equ 0001h
ANCON1_PCFG14_LENGTH                     equ 0001h
ANCON1_PCFG14_MASK                       equ 0040h
ANCON1_PCFG15_POSN                       equ 0007h
ANCON1_PCFG15_POSITION                   equ 0007h
ANCON1_PCFG15_SIZE                       equ 0001h
ANCON1_PCFG15_LENGTH                     equ 0001h
ANCON1_PCFG15_MASK                       equ 0080h

