GopalSaraf/Practicals/PSDL/include/proc/pic18f86k22.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h
// bitfield definitions
PCL_PCL_POSN                             equ 0000h
PCL_PCL_POSITION                         equ 0000h
PCL_PCL_SIZE                             equ 0008h
PCL_PCL_LENGTH                           equ 0008h
PCL_PCL_MASK                             equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh
// bitfield definitions
PCLATH_PCH_POSN                          equ 0000h
PCLATH_PCH_POSITION                      equ 0000h
PCLATH_PCH_SIZE                          equ 0008h
PCLATH_PCH_LENGTH                        equ 0008h
PCLATH_PCH_MASK                          equ 00FFh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define A16                              BANKMASK(PORTH), 0, a
#define A17                              BANKMASK(PORTH), 1, a
#define A18                              BANKMASK(PORTH), 2, a
#define A19                              BANKMASK(PORTH), 3, a
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, b
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, b
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define AD0                              BANKMASK(PORTD), 0, a
#define AD1                              BANKMASK(PORTD), 1, a
#define AD10                             BANKMASK(PORTE), 2, a
#define AD11                             BANKMASK(PORTE), 3, a
#define AD12                             BANKMASK(PORTE), 4, a
#define AD13                             BANKMASK(PORTE), 5, a
#define AD14                             BANKMASK(PORTE), 6, a
#define AD15                             BANKMASK(PORTE), 7, a
#define AD2                              BANKMASK(PORTD), 2, a
#define AD3                              BANKMASK(PORTD), 3, a
#define AD4                              BANKMASK(PORTD), 4, a
#define AD5                              BANKMASK(PORTD), 5, a
#define AD6                              BANKMASK(PORTD), 6, a
#define AD7                              BANKMASK(PORTD), 7, a
#define AD8                              BANKMASK(PORTE), 0, a
#define AD9                              BANKMASK(PORTE), 1, a
#define ADCMD                            BANKMASK(PMD0), 0, b
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN1                           BANKMASK(RCSTA1), 3, a
#define ADDEN2                           BANKMASK(RCSTA2), 3, b
#define ADEN                             BANKMASK(RCSTA1), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ALE                              BANKMASK(PORTJ), 0, a
#define ALRMEN                           BANKMASK(ALRMCFG), 7, b
#define ALRMPTR0                         BANKMASK(ALRMCFG), 0, b
#define ALRMPTR1                         BANKMASK(ALRMCFG), 1, b
#define AMASK0                           BANKMASK(ALRMCFG), 2, b
#define AMASK1                           BANKMASK(ALRMCFG), 3, b
#define AMASK2                           BANKMASK(ALRMCFG), 4, b
#define AMASK3                           BANKMASK(ALRMCFG), 5, b
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTF), 5, a
#define AN11                             BANKMASK(PORTF), 6, a
#define AN12                             BANKMASK(PORTH), 4, a
#define AN13                             BANKMASK(PORTH), 5, a
#define AN14                             BANKMASK(PORTH), 6, a
#define AN15                             BANKMASK(PORTH), 7, a
#define AN16                             BANKMASK(PORTG), 4, a
#define AN17                             BANKMASK(PORTG), 3, a
#define AN18                             BANKMASK(PORTG), 2, a
#define AN19                             BANKMASK(PORTG), 1, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN20                             BANKMASK(PORTH), 3, a
#define AN21                             BANKMASK(PORTH), 2, a
#define AN22                             BANKMASK(PORTH), 1, a
#define AN23                             BANKMASK(PORTH), 0, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN5                              BANKMASK(PORTF), 7, a
#define AN6                              BANKMASK(PORTF), 1, a
#define AN7                              BANKMASK(PORTF), 2, a
#define AN8                              BANKMASK(PORTF), 3, a
#define AN9                              BANKMASK(PORTF), 4, a
#define ANSEL0                           BANKMASK(ANCON0), 0, b
#define ANSEL1                           BANKMASK(ANCON0), 1, b
#define ANSEL10                          BANKMASK(ANCON1), 2, b
#define ANSEL11                          BANKMASK(ANCON1), 3, b
#define ANSEL12                          BANKMASK(ANCON1), 4, b
#define ANSEL13                          BANKMASK(ANCON1), 5, b
#define ANSEL14                          BANKMASK(ANCON1), 6, b
#define ANSEL15                          BANKMASK(ANCON1), 7, b
#define ANSEL16                          BANKMASK(ANCON2), 0, b
#define ANSEL17                          BANKMASK(ANCON2), 1, b
#define ANSEL18                          BANKMASK(ANCON2), 2, b
#define ANSEL19                          BANKMASK(ANCON2), 3, b
#define ANSEL2                           BANKMASK(ANCON0), 2, b
#define ANSEL20                          BANKMASK(ANCON2), 4, b
#define ANSEL21                          BANKMASK(ANCON2), 5, b
#define ANSEL22                          BANKMASK(ANCON2), 6, b
#define ANSEL23                          BANKMASK(ANCON2), 7, b
#define ANSEL3                           BANKMASK(ANCON0), 3, b
#define ANSEL4                           BANKMASK(ANCON0), 4, b
#define ANSEL5                           BANKMASK(ANCON0), 5, b
#define ANSEL6                           BANKMASK(ANCON0), 6, b
#define ANSEL7                           BANKMASK(ANCON0), 7, b
#define ANSEL8                           BANKMASK(ANCON1), 0, b
#define ANSEL9                           BANKMASK(ANCON1), 1, b
#define ARPT0                            BANKMASK(ALRMRPT), 0, b
#define ARPT1                            BANKMASK(ALRMRPT), 1, b
#define ARPT2                            BANKMASK(ALRMRPT), 2, b
#define ARPT3                            BANKMASK(ALRMRPT), 3, b
#define ARPT4                            BANKMASK(ALRMRPT), 4, b
#define ARPT5                            BANKMASK(ALRMRPT), 5, b
#define ARPT6                            BANKMASK(ALRMRPT), 6, b
#define ARPT7                            BANKMASK(ALRMRPT), 7, b
#define BA0                              BANKMASK(PORTJ), 4, a
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE2), 4, a
#define BCL2IF                           BANKMASK(PIR2), 4, a
#define BCL2IP                           BANKMASK(IPR2), 4, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, a
#define BGVST                            BANKMASK(HLVDCON), 6, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, b
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, b
#define C10TSEL0                         BANKMASK(CCPTMRS2), 4, b
#define C1CH0                            BANKMASK(CM1CON), 0, b
#define C1CH1                            BANKMASK(CM1CON), 1, b
#define C1INA                            BANKMASK(PORTF), 6, a
#define C1INB                            BANKMASK(PORTF), 5, a
#define C1INC                            BANKMASK(PORTH), 6, a
#define C1OUT                            BANKMASK(PORTF), 2, a
#define C1OUTF                           BANKMASK(PORTF), 2, a
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C1TSEL2                          BANKMASK(CCPTMRS0), 2, b
#define C2INA                            BANKMASK(PORTF), 4, a
#define C2INB                            BANKMASK(PORTF), 3, a
#define C2INC                            BANKMASK(PORTH), 4, a
#define C2IND                            BANKMASK(PORTH), 5, a
#define C2OUT                            BANKMASK(PORTF), 1, a
#define C2OUTF                           BANKMASK(PORTF), 1, a
#define C2TSEL0                          BANKMASK(CCPTMRS0), 3, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 4, b
#define C2TSEL2                          BANKMASK(CCPTMRS0), 5, b
#define C3INA                            BANKMASK(PORTG), 2, a
#define C3INB                            BANKMASK(PORTG), 3, a
#define C3INC                            BANKMASK(PORTG), 4, a
#define C3OUT                            BANKMASK(PORTG), 1, a
#define C3OUTG                           BANKMASK(PORTG), 1, a
#define C3TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define C4TSEL0                          BANKMASK(CCPTMRS1), 0, b
#define C4TSEL1                          BANKMASK(CCPTMRS1), 1, b
#define C5TSEL0                          BANKMASK(CCPTMRS1), 2, b
#define C6TSEL0                          BANKMASK(CCPTMRS1), 4, b
#define C7TSEL0                          BANKMASK(CCPTMRS1), 6, b
#define C7TSEL1                          BANKMASK(CCPTMRS1), 7, b
#define C8TSEL0                          BANKMASK(CCPTMRS2), 0, b
#define C8TSEL1                          BANKMASK(CCPTMRS2), 1, b
#define C9TSEL0                          BANKMASK(CCPTMRS2), 2, b
#define CAL0                             BANKMASK(RTCCAL), 0, b
#define CAL07                            BANKMASK(TMR7L), 0, b
#define CAL1                             BANKMASK(RTCCAL), 1, b
#define CAL17                            BANKMASK(TMR7L), 1, b
#define CAL2                             BANKMASK(RTCCAL), 2, b
#define CAL27                            BANKMASK(TMR7L), 2, b
#define CAL3                             BANKMASK(RTCCAL), 3, b
#define CAL37                            BANKMASK(TMR7L), 3, b
#define CAL4                             BANKMASK(RTCCAL), 4, b
#define CAL47                            BANKMASK(TMR7L), 4, b
#define CAL5                             BANKMASK(RTCCAL), 5, b
#define CAL57                            BANKMASK(TMR7L), 5, b
#define CAL6                             BANKMASK(RTCCAL), 6, b
#define CAL67                            BANKMASK(TMR7L), 6, b
#define CAL7                             BANKMASK(RTCCAL), 7, b
#define CAL77                            BANKMASK(TMR7L), 7, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH01                            BANKMASK(CM1CON), 0, b
#define CCH02                            BANKMASK(CM2CON), 0, b
#define CCH03                            BANKMASK(CM3CON), 0, b
#define CCH05                            BANKMASK(IPR5), 0, a
#define CCH11                            BANKMASK(CM1CON), 1, b
#define CCH12                            BANKMASK(CM2CON), 1, b
#define CCH13                            BANKMASK(CM3CON), 1, b
#define CCH15                            BANKMASK(IPR5), 1, a
#define CCIP3IP                          BANKMASK(IPR4), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP10IE                          BANKMASK(PIE4), 7, a
#define CCP10IF                          BANKMASK(PIR4), 7, a
#define CCP10IP                          BANKMASK(IPR4), 7, a
#define CCP10M0                          BANKMASK(CCP10CON), 0, b
#define CCP10M1                          BANKMASK(CCP10CON), 1, b
#define CCP10M2                          BANKMASK(CCP10CON), 2, b
#define CCP10M3                          BANKMASK(CCP10CON), 3, b
#define CCP10MD                          BANKMASK(PMD3), 7, b
#define CCP10OD                          BANKMASK(ODCON2), 7, b
#define CCP10X                           BANKMASK(CCP10CON), 5, b
#define CCP10Y                           BANKMASK(CCP10CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 1, a
#define CCP1IF                           BANKMASK(PIR3), 1, a
#define CCP1IP                           BANKMASK(IPR3), 1, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1MD                           BANKMASK(PMD0), 5, b
#define CCP1OD                           BANKMASK(ODCON1), 5, b
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2E                            BANKMASK(PORTE), 7, a
#define CCP2IE                           BANKMASK(PIE3), 2, a
#define CCP2IF                           BANKMASK(PIR3), 2, a
#define CCP2IP                           BANKMASK(IPR3), 2, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, b
#define CCP2M1                           BANKMASK(CCP2CON), 1, b
#define CCP2M2                           BANKMASK(CCP2CON), 2, b
#define CCP2M3                           BANKMASK(CCP2CON), 3, b
#define CCP2MD                           BANKMASK(PMD0), 6, b
#define CCP2OD                           BANKMASK(ODCON1), 6, b
#define CCP2X                            BANKMASK(CCP2CON), 5, b
#define CCP2Y                            BANKMASK(CCP2CON), 4, b
#define CCP2_P2A                         BANKMASK(PORTB), 3, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3                             BANKMASK(PORTG), 0, a
#define CCP3IE                           BANKMASK(PIE4), 0, a
#define CCP3IF                           BANKMASK(PIR4), 0, a
#define CCP3IP                           BANKMASK(IPR4), 0, a
#define CCP3M0                           BANKMASK(CCP3CON), 0, b
#define CCP3M1                           BANKMASK(CCP3CON), 1, b
#define CCP3M2                           BANKMASK(CCP3CON), 2, b
#define CCP3M3                           BANKMASK(CCP3CON), 3, b
#define CCP3MD                           BANKMASK(PMD0), 7, b
#define CCP3OD                           BANKMASK(ODCON2), 0, b
#define CCP4                             BANKMASK(PORTG), 3, a
#define CCP4IE                           BANKMASK(PIE4), 1, a
#define CCP4IF                           BANKMASK(PIR4), 1, a
#define CCP4IP                           BANKMASK(IPR4), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, a
#define CCP4M1                           BANKMASK(CCP4CON), 1, a
#define CCP4M2                           BANKMASK(CCP4CON), 2, a
#define CCP4M3                           BANKMASK(CCP4CON), 3, a
#define CCP4MD                           BANKMASK(PMD3), 1, b
#define CCP4OD                           BANKMASK(ODCON2), 1, b
#define CCP4X                            BANKMASK(CCP4CON), 5, a
#define CCP4Y                            BANKMASK(CCP4CON), 4, a
#define CCP5                             BANKMASK(PORTG), 4, a
#define CCP5IE                           BANKMASK(PIE4), 2, a
#define CCP5IF                           BANKMASK(PIR4), 2, a
#define CCP5IP                           BANKMASK(IPR4), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, a
#define CCP5M1                           BANKMASK(CCP5CON), 1, a
#define CCP5M2                           BANKMASK(CCP5CON), 2, a
#define CCP5M3                           BANKMASK(CCP5CON), 3, a
#define CCP5MD                           BANKMASK(PMD3), 2, b
#define CCP5OD                           BANKMASK(ODCON2), 2, b
#define CCP5X                            BANKMASK(CCP5CON), 5, a
#define CCP5Y                            BANKMASK(CCP5CON), 4, a
#define CCP6E                            BANKMASK(PORTE), 6, a
#define CCP6IE                           BANKMASK(PIE4), 3, a
#define CCP6IF                           BANKMASK(PIR4), 3, a
#define CCP6IP                           BANKMASK(IPR4), 3, a
#define CCP6M0                           BANKMASK(CCP6CON), 0, a
#define CCP6M1                           BANKMASK(CCP6CON), 1, a
#define CCP6M2                           BANKMASK(CCP6CON), 2, a
#define CCP6M3                           BANKMASK(CCP6CON), 3, a
#define CCP6MD                           BANKMASK(PMD3), 3, b
#define CCP6OD                           BANKMASK(ODCON2), 3, b
#define CCP6X                            BANKMASK(CCP6CON), 5, a
#define CCP6Y                            BANKMASK(CCP6CON), 4, a
#define CCP7E                            BANKMASK(PORTE), 5, a
#define CCP7IE                           BANKMASK(PIE4), 4, a
#define CCP7IF                           BANKMASK(PIR4), 4, a
#define CCP7IP                           BANKMASK(IPR4), 4, a
#define CCP7M0                           BANKMASK(CCP7CON), 0, a
#define CCP7M1                           BANKMASK(CCP7CON), 1, a
#define CCP7M2                           BANKMASK(CCP7CON), 2, a
#define CCP7M3                           BANKMASK(CCP7CON), 3, a
#define CCP7MD                           BANKMASK(PMD3), 4, b
#define CCP7OD                           BANKMASK(ODCON2), 4, b
#define CCP7X                            BANKMASK(CCP7CON), 5, a
#define CCP7Y                            BANKMASK(CCP7CON), 4, a
#define CCP8E                            BANKMASK(PORTE), 4, a
#define CCP8IE                           BANKMASK(PIE4), 5, a
#define CCP8IF                           BANKMASK(PIR4), 5, a
#define CCP8IP                           BANKMASK(IPR4), 5, a
#define CCP8M0                           BANKMASK(CCP8CON), 0, b
#define CCP8M1                           BANKMASK(CCP8CON), 1, b
#define CCP8M2                           BANKMASK(CCP8CON), 2, b
#define CCP8M3                           BANKMASK(CCP8CON), 3, b
#define CCP8MD                           BANKMASK(PMD3), 5, b
#define CCP8OD                           BANKMASK(ODCON2), 5, b
#define CCP8X                            BANKMASK(CCP8CON), 5, b
#define CCP8Y                            BANKMASK(CCP8CON), 4, b
#define CCP9E                            BANKMASK(PORTE), 3, a
