GopalSaraf/Practicals/PSDL/include/proc/pic18f86k22.inc
#define SOSCO                            BANKMASK(PORTC), 0, a
#define SOSCRUN                          BANKMASK(OSCCON2), 6, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, b
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI1OD                           BANKMASK(ODCON1), 7, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SPI2OD                           BANKMASK(ODCON1), 0, b
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, b
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SRETEN                           BANKMASK(WDTCON), 4, a
#define SS1                              BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSP1MD                           BANKMASK(PMD0), 1, b
#define SSP2IE                           BANKMASK(PIE2), 5, a
#define SSP2IF                           BANKMASK(PIR2), 5, a
#define SSP2IP                           BANKMASK(IPR2), 5, a
#define SSP2MD                           BANKMASK(PMD0), 2, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, a
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, a
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, a
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM32                           BANKMASK(SSP2CON1), 3, a
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, a
#define START                            BANKMASK(SSP1STAT), 3, a
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSP1STAT), 4, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, a
#define STRA2                            BANKMASK(PSTR2CON), 0, b
#define STRA3                            BANKMASK(PSTR3CON), 0, b
#define STRB2                            BANKMASK(PSTR2CON), 1, b
#define STRB3                            BANKMASK(PSTR3CON), 1, b
#define STRC2                            BANKMASK(PSTR2CON), 2, b
#define STRC3                            BANKMASK(PSTR3CON), 2, b
#define STRD2                            BANKMASK(PSTR2CON), 3, b
#define STRD3                            BANKMASK(PSTR3CON), 3, b
#define STRSYNC2                         BANKMASK(PSTR2CON), 4, b
#define STRSYNC3                         BANKMASK(PSTR3CON), 4, b
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, b
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T10CKPS0                         BANKMASK(T10CON), 0, b
#define T10CKPS1                         BANKMASK(T10CON), 1, b
#define T10OUTPS0                        BANKMASK(T10CON), 3, b
#define T10OUTPS1                        BANKMASK(T10CON), 4, b
#define T10OUTPS2                        BANKMASK(T10CON), 5, b
#define T10OUTPS3                        BANKMASK(T10CON), 6, b
#define T12CKPS0                         BANKMASK(T12CON), 0, b
#define T12CKPS1                         BANKMASK(T12CON), 1, b
#define T12OUTPS0                        BANKMASK(T12CON), 3, b
#define T12OUTPS1                        BANKMASK(T12CON), 4, b
#define T12OUTPS2                        BANKMASK(T12CON), 5, b
#define T12OUTPS3                        BANKMASK(T12CON), 6, b
#define T1CKI                            BANKMASK(PORTA), 5, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1G                              BANKMASK(PORTB), 5, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_T1DONE                 BANKMASK(T1GCON), 3, a
#define T1GGO_nT1DONE                    BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GCON), 0, a
#define T1GSS1                           BANKMASK(T1GCON), 1, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CKI                            BANKMASK(PORTB), 5, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3G                              BANKMASK(PORTA), 5, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_T3DONE                 BANKMASK(T3GCON), 3, a
#define T3GGO_nT3DONE                    BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, a
#define T4CKPS1                          BANKMASK(T4CON), 1, a
#define T4OUTPS0                         BANKMASK(T4CON), 3, a
#define T4OUTPS1                         BANKMASK(T4CON), 4, a
#define T4OUTPS2                         BANKMASK(T4CON), 5, a
#define T4OUTPS3                         BANKMASK(T4CON), 6, a
#define T5CKI                            BANKMASK(PORTD), 1, a
#define T5CKPS0                          BANKMASK(T5CON), 4, a
#define T5CKPS1                          BANKMASK(T5CON), 5, a
#define T5G                              BANKMASK(PORTG), 4, a
#define T5GGO                            BANKMASK(T5GCON), 3, a
#define T5GGO_NOT_T5DONE                 BANKMASK(T5GCON), 3, a
#define T5GGO_nT5DONE                    BANKMASK(T5GCON), 3, a
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GCON), 0, a
#define T5GSS1                           BANKMASK(T5GCON), 1, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T6CKPS0                          BANKMASK(T6CON), 0, b
#define T6CKPS1                          BANKMASK(T6CON), 1, b
#define T6OUTPS0                         BANKMASK(T6CON), 3, b
#define T6OUTPS1                         BANKMASK(T6CON), 4, b
#define T6OUTPS2                         BANKMASK(T6CON), 5, b
#define T6OUTPS3                         BANKMASK(T6CON), 6, b
#define T7CKI                            BANKMASK(PORTG), 4, a
#define T7CKPS0                          BANKMASK(T7CON), 4, b
#define T7CKPS1                          BANKMASK(T7CON), 5, b
#define T7G                              BANKMASK(PORTD), 1, a
#define T7GGO                            BANKMASK(T7GCON), 3, b
#define T7GGO_NOT_T7DONE                 BANKMASK(T7GCON), 3, b
#define T7GGO_nT7DONE                    BANKMASK(T7GCON), 3, b
#define T7GPOL                           BANKMASK(T7GCON), 6, b
#define T7GSPM                           BANKMASK(T7GCON), 4, b
#define T7GSS0                           BANKMASK(T7GCON), 0, b
#define T7GSS1                           BANKMASK(T7GCON), 1, b
#define T7GTM                            BANKMASK(T7GCON), 5, b
#define T7GVAL                           BANKMASK(T7GCON), 2, b
#define T8CKPS0                          BANKMASK(T8CON), 0, b
#define T8CKPS1                          BANKMASK(T8CON), 1, b
#define T8OUTPS0                         BANKMASK(T8CON), 3, b
#define T8OUTPS1                         BANKMASK(T8CON), 4, b
#define T8OUTPS2                         BANKMASK(T8CON), 5, b
#define T8OUTPS3                         BANKMASK(T8CON), 6, b
#define TGEN                             BANKMASK(CTMUCONH), 4, b
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR10IE                          BANKMASK(PIE5), 5, a
#define TMR10IF                          BANKMASK(PIR5), 5, a
#define TMR10IP                          BANKMASK(IPR5), 5, a
#define TMR10MD                          BANKMASK(PMD2), 7, b
#define TMR10ON                          BANKMASK(T10CON), 2, b
#define TMR12IE                          BANKMASK(PIE5), 6, a
#define TMR12IF                          BANKMASK(PIR5), 6, a
#define TMR12IP                          BANKMASK(IPR5), 6, a
#define TMR12MD                          BANKMASK(PMD3), 0, b
#define TMR12ON                          BANKMASK(T12CON), 2, b
#define TMR1CS0                          BANKMASK(T1CON), 6, a
#define TMR1CS1                          BANKMASK(T1CON), 7, a
#define TMR1GE                           BANKMASK(T1GCON), 7, a
#define TMR1GIE                          BANKMASK(PIE1), 2, a
#define TMR1GIF                          BANKMASK(PIR1), 2, a
#define TMR1GIP                          BANKMASK(IPR1), 2, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS0                          BANKMASK(T3CON), 6, a
#define TMR3CS1                          BANKMASK(T3CON), 7, a
#define TMR3GE                           BANKMASK(T3GCON), 7, a
#define TMR3GIE                          BANKMASK(PIE2), 0, a
#define TMR3GIF                          BANKMASK(PIR2), 0, a
#define TMR3GIP                          BANKMASK(IPR2), 0, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE5), 0, a
#define TMR4IF                           BANKMASK(PIR5), 0, a
#define TMR4IP                           BANKMASK(IPR5), 0, a
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 2, a
#define TMR5CS0                          BANKMASK(T5CON), 6, a
#define TMR5CS1                          BANKMASK(T5CON), 7, a
#define TMR5GE                           BANKMASK(T5GCON), 7, a
#define TMR5GIE                          BANKMASK(PIE3), 7, a
#define TMR5GIF                          BANKMASK(PIR3), 7, a
#define TMR5GIP                          BANKMASK(IPR3), 7, a
#define TMR5IE                           BANKMASK(PIE5), 1, a
#define TMR5IF                           BANKMASK(PIR5), 1, a
#define TMR5IP                           BANKMASK(IPR5), 1, a
#define TMR5MD                           BANKMASK(PMD2), 3, b
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TMR6IE                           BANKMASK(PIE5), 2, a
#define TMR6IF                           BANKMASK(PIR5), 2, a
#define TMR6IP                           BANKMASK(IPR5), 2, a
#define TMR6MD                           BANKMASK(PMD2), 4, b
#define TMR6ON                           BANKMASK(T6CON), 2, b
#define TMR7CS0                          BANKMASK(T7CON), 6, b
#define TMR7CS1                          BANKMASK(T7CON), 7, b
#define TMR7GE                           BANKMASK(T7GCON), 7, b
#define TMR7GIE                          BANKMASK(PIE5), 7, a
#define TMR7GIF                          BANKMASK(PIR5), 7, a
#define TMR7GIP                          BANKMASK(IPR5), 7, a
#define TMR7IE                           BANKMASK(PIE5), 3, a
#define TMR7IF                           BANKMASK(PIR5), 3, a
#define TMR7IP                           BANKMASK(IPR5), 3, a
#define TMR7MD                           BANKMASK(PMD2), 5, b
#define TMR7ON                           BANKMASK(T7CON), 0, b
#define TMR8IE                           BANKMASK(PIE5), 4, a
#define TMR8IF                           BANKMASK(PIR5), 4, a
#define TMR8IP                           BANKMASK(IPR5), 4, a
#define TMR8MD                           BANKMASK(PMD2), 6, b
#define TMR8ON                           BANKMASK(T8CON), 2, b
#define TO                               BANKMASK(RCON), 3, a
#define TRIGSEL0                         BANKMASK(ADCON1), 6, a
#define TRIGSEL1                         BANKMASK(ADCON1), 7, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISE3                           BANKMASK(TRISE), 3, a
#define TRISE4                           BANKMASK(TRISE), 4, a
#define TRISE5                           BANKMASK(TRISE), 5, a
#define TRISE6                           BANKMASK(TRISE), 6, a
#define TRISE7                           BANKMASK(TRISE), 7, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TRISG0                           BANKMASK(TRISG), 0, a
#define TRISG1                           BANKMASK(TRISG), 1, a
#define TRISG2                           BANKMASK(TRISG), 2, a
#define TRISG3                           BANKMASK(TRISG), 3, a
#define TRISG4                           BANKMASK(TRISG), 4, a
#define TRISH0                           BANKMASK(TRISH), 0, a
#define TRISH1                           BANKMASK(TRISH), 1, a
#define TRISH2                           BANKMASK(TRISH), 2, a
#define TRISH3                           BANKMASK(TRISH), 3, a
#define TRISH4                           BANKMASK(TRISH), 4, a
#define TRISH5                           BANKMASK(TRISH), 5, a
#define TRISH6                           BANKMASK(TRISH), 6, a
#define TRISH7                           BANKMASK(TRISH), 7, a
#define TRISJ0                           BANKMASK(TRISJ), 0, a
#define TRISJ1                           BANKMASK(TRISJ), 1, a
#define TRISJ2                           BANKMASK(TRISJ), 2, a
#define TRISJ3                           BANKMASK(TRISJ), 3, a
#define TRISJ4                           BANKMASK(TRISJ), 4, a
#define TRISJ5                           BANKMASK(TRISJ), 5, a
#define TRISJ6                           BANKMASK(TRISJ), 6, a
#define TRISJ7                           BANKMASK(TRISJ), 7, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRMT2                            BANKMASK(TXSTA2), 1, b
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TUN5                             BANKMASK(OSCTUNE), 5, a
#define TX1                              BANKMASK(PORTC), 6, a
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2                              BANKMASK(PORTG), 1, a
#define TX2IE                            BANKMASK(PIE3), 4, a
#define TX2IF                            BANKMASK(PIR3), 4, a
#define TX2IP                            BANKMASK(IPR3), 4, a
#define TX8_9                            BANKMASK(TXSTA1), 6, a
#define TX8_92                           BANKMASK(TXSTA2), 6, b
#define TX91                             BANKMASK(TXSTA1), 6, a
#define TX92                             BANKMASK(TXSTA2), 6, b
#define TX9D1                            BANKMASK(TXSTA1), 0, a
#define TX9D2                            BANKMASK(TXSTA2), 0, b
#define TXB0IE                           BANKMASK(PIE3), 2, a
#define TXB1IE                           BANKMASK(PIE3), 3, a
#define TXB2IE                           BANKMASK(PIE3), 4, a
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXCKP1                           BANKMASK(BAUDCON1), 4, a
#define TXCKP2                           BANKMASK(BAUDCON2), 4, b
#define TXD8                             BANKMASK(TXSTA1), 0, a
#define TXD82                            BANKMASK(TXSTA2), 0, b
#define TXEN1                            BANKMASK(TXSTA1), 5, a
#define TXEN2                            BANKMASK(TXSTA2), 5, b
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXIP                             BANKMASK(IPR1), 4, a
#define U1OD                             BANKMASK(ODCON3), 6, b
#define U2OD                             BANKMASK(ODCON3), 7, b
#define UA1                              BANKMASK(SSP1STAT), 1, a
#define UA2                              BANKMASK(SSP2STAT), 1, a
#define UART1MD                          BANKMASK(PMD0), 3, b
#define UART2MD                          BANKMASK(PMD0), 4, b
#define UB                               BANKMASK(PORTJ), 7, a
#define ULPEN                            BANKMASK(WDTCON), 2, a
#define ULPLVL                           BANKMASK(WDTCON), 5, a
#define ULPSINK                          BANKMASK(WDTCON), 1, a
#define ULPWU                            BANKMASK(PORTA), 0, a
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define VCFG0                            BANKMASK(ADCON1), 4, a
#define VCFG01                           BANKMASK(ADCON1), 4, a
#define VCFG1                            BANKMASK(ADCON1), 5, a
#define VCFG11                           BANKMASK(ADCON1), 5, a
#define VDIRMAG                          BANKMASK(HLVDCON), 7, a
#define VNCFG                            BANKMASK(ADCON1), 3, a
#define VREF_MINUS                       BANKMASK(PORTA), 2, a
#define VREF_PLUS                        BANKMASK(PORTA), 3, a
#define W4E                              BANKMASK(BAUDCON1), 1, a
#define WAIT0                            BANKMASK(MEMCON), 4, b
#define WAIT1                            BANKMASK(MEMCON), 5, b
#define WAITB0                           BANKMASK(RTCVALH), 6, b
#define WAITB1                           BANKMASK(RTCVALH), 7, b
